# coding=utf-8

'''
Created on Jul 2, 2013

@author: george.g.zhao
'''

import logging
logger = logging.getLogger('jd_crawler')
hdlr = logging.FileHandler('../log/jd_crawler.log')
formatter = logging.Formatter('%(asctime)s %(levelname)s %(message)s')
hdlr.setFormatter(formatter)
logger.addHandler(hdlr) 
logger.setLevel(logging.ERROR)
logging.disable(logging.WARNING)


CATEGORIES = {
'670-671-672':'笔记本',
'670-671-6864':'超极本',
'670-671-1105':'上网本',
'670-671-2694':'平板电脑',
'670-671-5146':'平板电脑配件',
'670-671-673':'台式机',
'670-671-674':'服务器',
'670-671-675':'笔记本配件',
'670-677-678':'CPU',
'670-677-681':'主板',
'670-677-679':'显卡',
'670-677-683':'硬盘',
'670-677-680':'内存',
'670-677-687':'机箱',
'670-677-691':'电源',
'670-677-688':'显示器',
'670-677-684':'刻录机/光驱',
'670-677-682':'散热器',
'670-677-5008':'声卡/扩展卡',
'670-677-5009':'装机配件',
'670-686-690':'鼠标',
'670-686-689':'键盘',
'670-686-693':'移动硬盘',
'670-686-694':'U盘',
'670-686-692':'摄像头',
'670-686-695':'外置盒',
'670-686-696':'游戏设备',
'670-686-697':'电视盒',
'670-686-698':'手写板',
'670-686-826':'鼠标垫',
'670-686-1047':'插座',
'670-686-1048':'UPS电源',
'670-686-1049':'线缆',
'670-686-1050':'电脑工具',
'670-686-1051':'电脑清洁',
'670-699-700':'路由器',
'670-699-701':'网卡',
'670-699-702':'交换机',
'670-699-983':'网络存储',
'670-699-1098':'3G上网',
'670-716-717':'打印机',
'670-716-720':'一体机',
'670-716-722':'投影机',
'670-716-5010':'投影配件',
'670-716-718':'传真机',
'670-716-719':'复合机',
'670-716-723':'碎纸机',
'670-716-721':'扫描仪',
'670-716-731':'墨盒',
'670-716-730':'硒鼓',
'670-716-732':'墨粉',
'670-716-733':'色带',
'670-729-4837':'办公文具',
'670-729-4840':'文件管理',
'670-729-2603':'笔类',
'670-729-736':'纸类',
'670-729-7371':'本册/便签',
'670-729-1449':'学生文具',
'670-729-7372':'财务用品',
'670-729-728':'计算器',
'670-729-1229':'激光笔',
'670-729-4839':'白板/封装',
'670-729-724':'考勤机',
'670-729-4838':'刻录碟片/附件',
'670-729-725':'点钞机',
'670-729-7373':'支付设备/POS机',
'670-729-7374':'安防监控',
'670-729-7375':'呼叫/会议设备',
'670-729-2601':'保险柜',
'670-703-10011':'上门服务',
'670-703-10970':'远程服务',
'670-703-5011':'电脑软件',
'670-703-1009':'京东服务'
}

LEVEL1_URL_FORMAT = 'http://list.jd.com/%s.html'
LEVEL2_URL_FORMAT = 'http://list.jd.com/%s-0-0-0-0-0-0-1-1-%d-1.html'

COMMENTS_URL_FORMAT = 'http://club.jd.com/review/%s-1-%d-0.html'

FILEPATH = '../data/'

ITEMS = set([]) #items has been already crawled
for line in open(FILEPATH+'items.txt'):
    ITEMS.add(int(line.split('::')[0]))

ITEMS_OUT= open(FILEPATH+'items.txt','a',1)
